#!/usr/bin/env python3
#author:Alnk(李成果)
"""
int ：
    整型
	1 100 ，-98 ....
	在32位机器上，整数的位数为32位，取值范围为-2**31～2**31-1，即-2147483648～2147483647
    在64位系统上，整数的位数为64位，取值范围为-2**63～2**63-1，即-9223372036854775808～9223372036854775807
		
	str ： 
	    python中凡是用引号引起来的的内容就是字符串。
		' '  " "  """ """   ''' ''' 

	bool: 
	    True False
	    用于不等式或者条件的判断。
"""

"""
#int
#i1 = 100
#i2 = 20
#print(i1 + i2)

"""

"""
#str
s1 = "太白金星"
s2 = '太白金星'
s3 = 'I\'m taibai, my age is 18'
s3 = "I'm taibai, my age is 18"
#print(s3)
# ''' ''' """ """ 换行的字符串需要三引号
msg = '''
今天我想写首小诗，
歌颂我的同桌，
你看他那乌黑的短发，
好像一只炸毛鸡。
'''
#print(msg)
# 
# 字符串 可以相加，可以与数字相乘
s1 = 'alex'
s2 = 'sb'
s3 = s1 + s2
#print(s3)
# 
#s4 = '坚强'
#print(s4 * 8)

"""

"""
# bool
#print(1 > 2)
#print(3 > 2)
#s5 = 'True'
#b1 = True
#print(s5, b1)
#print(s5, type(s5))
#print(b1, type(b1))
"""